hebertreis/taptosow/esp8266-arduino/src/main.cpp
/**
 * OneTapGo - ESP8266 NFC Writer with MQTT Integration
 * Hardware: NodeMCU LoLin V3 (HW 364-A) with RC522 NFC Reader and LCD Display
 * 
 * Features:
 * - WiFi Manager for hotspot configuration
 * - MQTT over TLS for secure communication
 * - LCD display for operator feedback
 * - OTA updates support
 * - Watchdog handling
 * - Production-ready error handling and reconnection logic
 * - Debug mode for detailed NFC tag information
 * - Read mode for reading and sending tag data
 *
 * MQTT Topics:
 * - onetapgo/{deviceId}/status      - Device status updates
 * - onetapgo/{deviceId}/heartbeat   - Heartbeat messages
 * - onetapgo/{deviceId}/command     - Commands from admin
 * - onetapgo/{deviceId}/result      - Write results and tag data
 * - onetapgo/{deviceId}/debug       - Debug and mode status
 *
 * MQTT Commands (send to /command topic):
 * - write_tag: { "type": "write_tag", "tenantId": "xxx", "sectorId": "yyy", "url": "https://..." }
 * - set_debug: { "type": "set_debug", "enabled": true/false }
 * - set_read_mode: { "type": "set_read_mode", "enabled": true/false }
 * - read_tag: { "type": "read_tag" }  // One-time read
 * - status: { "type": "status" }      // Request current status
 * - restart: { "type": "restart" }    // Restart device
 *
 * @version 3.1.0
 * @author OneTapGo by CRE8 Tecnologia
 */

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <PubSubClient.h>
#include <ESP8266HTTPClient.h>
#include <WiFiManager.h>
#include <ArduinoJson.h>
#include <SPI.h>
#include <NdefMessage.h>
#include <NfcAdapter.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

// ============================================================================
// CONFIGURATION - Update these values for your deployment
// ============================================================================

// MQTT Configuration
#define MQTT_HOST "m191dfff.ala.us-east-1.emqxsl.com"
#define MQTT_PORT 8883
#define MQTT_USERNAME "onetapgo"
#define MQTT_PASSWORD "onetapgo"
#define MQTT_USE_TLS true
#define MQTT_CLIENT_PREFIX "onetapgo_device"

// Device Configuration
#define DEVICE_VERSION "3.2.0"
#define HEARTBEAT_INTERVAL 30000      // 30 seconds
#define WIFI_RECONNECT_INTERVAL 10000 // 10 seconds
#define MQTT_RECONNECT_DELAY 5000     // 5 seconds
#define MAX_RECONNECT_ATTEMPTS 10

// NFC Optimization Configuration
#define NFC_POLL_INTERVAL 50          // 50ms between NFC polls (faster detection)
#define NFC_ACTIVITY_TIMEOUT 5000     // 5 seconds timeout for NFC operations
#define SECTOR_COUNT 16               // Number of sectors to read (for 1K cards)

// Hardware Configuration - NodeMCU LoLin V3
#define RC522_SS_PIN  4   // D2 (GPIO 4)
#define RC522_RST_PIN 5   // D1 (GPIO 5)

// LCD Display Configuration (SSD1306 128x64)
#define OLED_SDA_PIN 14    // D4 (GPIO 2)
#define OLED_SCL_PIN 12   // D5 (GPIO 14)
#define OLED_RESET_PIN -1 // RST (GPIO 16)
#define OLED_ADDRESS 0x3C

// Button Configuration (optional)
#define BUTTON_PIN 0      // D3 (GPIO 0) - Optional button for manual trigger

// ============================================================================
// GLOBAL VARIABLES
// ============================================================================

// Hardware instances
ESP8266WiFiMulti wifiMulti;
WiFiClientSecure wifiClient;
PubSubClient mqttClient;
MFRC522 mfrc522(RC522_SS_PIN, RC522_RST_PIN);  // Agora usa MFRC522
NfcAdapter nfc = NfcAdapter(&mfrc522);
Adafruit_SSD1306 display(128, 64, &Wire, OLED_RESET_PIN);

// State variables
String deviceId = "";
String mqttTopicBase = "";
bool isMqttConnected = false;
bool isWifiConnected = false;
bool isNfcConnected = false;
byte nfcFirmwareVersion = 0x00;
unsigned long lastHeartbeat = 0;
unsigned long lastReconnectAttempt = 0;
int reconnectAttempts = 0;
unsigned long lastActivityTime = 0;

// Working state
enum DeviceState {
    STATE_IDLE,
    STATE_WAITING_TAG,
    STATE_TAG_DETECTED,
    STATE_WRITING,
    STATE_SUCCESS,
    STATE_ERROR,
    STATE_CONFIG_MODE,
    STATE_READ_MODE
};

DeviceState currentState = STATE_IDLE;
String pendingTenantId = "";
String pendingSectorId = "";
String pendingUrl = "";
bool debugMode = false;
bool readMode = true;  // Default to read mode (always transmitting to MQTT)
bool hasPendingWriteCommand = false;  // True when waiting for write command from MQTT

// Forward declarations
void publishStatus();
void publishHeartbeat();
void publishDebugStatus();
void publishReadModeStatus();
void publishTagData(const String& tagId, const String& ndefUrl = "");
String readTagData();
String readAllSectorData();
String extractNdefUrl();
void waitForTagRemoval();

// ============================================================================
// LCD DISPLAY FUNCTIONS
// ============================================================================

void displayInit() {
    Wire.begin(OLED_SDA_PIN, OLED_SCL_PIN);

    if (!display.begin(SSD1306_SWITCHCAPVCC, OLED_ADDRESS)) {
        Serial.println(F("SSD1306 allocation failed"));
        return;
    }

    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(0, 0);
    display.println(F("OneTapGo v" DEVICE_VERSION));
    display.println(F("Initializing..."));
    display.display();
    delay(500); // Reduced from 1000ms
}

void displayShowState(DeviceState state, const char* extraInfo = nullptr) {
    display.clearDisplay();
    display.setCursor(0, 0);

    // Header
    display.setTextSize(1);
    display.println(F("=== OneTapGo ==="));
    display.println();

    // State display
    display.setTextSize(1);
    switch (state) {
        case STATE_IDLE:
            // Only show "Ready" if all systems are connected
            if (isWifiConnected && isMqttConnected && isNfcConnected) {
                if (hasPendingWriteCommand) {
                    display.println(F("Mode: Writer"));
                    display.println(F("Waiting for tag..."));
                } else if (readMode) {
                    display.println(F("Mode: Reader"));
                    display.println(F("Auto-transmitting"));
                } else {
                    display.println(F("Status: Ready"));
                }
            } else {
                display.println(F("Status: Initializing"));
                // Show what's missing
                if (!isWifiConnected) {
                    display.println(F("- WiFi"));
                }
                if (!isMqttConnected) {
                    display.println(F("- MQTT"));
                }
                if (!isNfcConnected) {
                    display.println(F("- NFC"));
                }
            }
            break;
        case STATE_WAITING_TAG:
            display.println(F("Mode: Writer"));
            display.println(F("Waiting for tag..."));
            break;
        case STATE_TAG_DETECTED:
            display.println(F("Status: Tag Found"));
            break;
        case STATE_WRITING:
            display.println(F("Mode: Writing"));
            display.println(F("Programming tag..."));
            break;
        case STATE_SUCCESS:
            display.setTextSize(2);
            display.println(F("SUCCESS!"));
            display.setTextSize(1);
            display.println();
            display.println(F("Remove tag"));
            break;
        case STATE_ERROR:
            display.setTextSize(2);
            display.println(F("ERROR"));
            display.setTextSize(1);
            display.println();
            if (extraInfo) {
                display.println(extraInfo);
            } else {
                display.println(F("Write failed"));
            }
            break;
        case STATE_CONFIG_MODE:
            display.println(F("WiFi Config Mode"));
            display.println(F("Connect to AP"));
            break;
        case STATE_READ_MODE:
            display.println(F("Mode: Reader"));
            display.println(F("Auto-transmitting"));
            break;
    }

    // Footer - Connection status
    display.println();
    display.setTextSize(1);
    String statusLine = F("WiFi:");
    statusLine += isWifiConnected ? "OK" : "NO";
    statusLine += F(" MQTT:");
    statusLine += isMqttConnected ? "OK" : "NO";
    display.println(statusLine);
    
    // NFC status line
    String nfcLine = F("NFC:");
    nfcLine += isNfcConnected ? "OK" : "NO";
    if (isNfcConnected && nfcFirmwareVersion != 0x00) {
        nfcLine += F(" v0x");
        nfcLine += String(nfcFirmwareVersion, HEX);
    }
    display.println(nfcLine);

    // IP Address if connected
    if (isWifiConnected) {
        display.print(F("IP: "));
        display.println(WiFi.localIP().toString());
    }
    
