hebertreis/taptosow/esp8266-arduino/src/main.cpp
    // Configure MQTT client
    mqttClient.setClient(wifiClient);
    mqttClient.setServer(MQTT_HOST, MQTT_PORT);
    mqttClient.setCallback(mqttCallback);
    mqttClient.setBufferSize(1024);
    mqttClient.setKeepAlive(60);
    mqttClient.setSocketTimeout(30);
    
    Serial.print(F("[MQTT] Server: "));
    Serial.println(MQTT_HOST);
    Serial.print(F("[MQTT] Port: "));
    Serial.println(MQTT_PORT);
    Serial.print(F("[MQTT] Client ID: "));
    Serial.println(deviceId);
}

bool mqttConnect() {
    if (mqttClient.connected()) {
        return true;
    }
    
    Serial.print(F("[MQTT] Connecting..."));
    
    // Last will message
    String willTopic = mqttTopicBase + "/status";
    String willMessage = "{\"status\":\"offline\",\"timestamp\":" + String(millis()) + "}";
    
    if (mqttClient.connect(deviceId.c_str(), MQTT_USERNAME, MQTT_PASSWORD,
                          willTopic.c_str(), 1, true, willMessage.c_str())) {
        Serial.println(F(" OK"));

        // Subscribe to command topic
        String commandTopic = mqttTopicBase + "/command";
        mqttClient.subscribe(commandTopic.c_str(), 1);
        Serial.print(F("[MQTT] Subscribed to: "));
        Serial.println(commandTopic);

        isMqttConnected = true;
        publishStatus();
        
        // Update display to show MQTT connected
        displayShowState(currentState);

        return true;
    } else {
        Serial.print(F(" FAILED - Code: "));
        Serial.println(mqttClient.state());
        isMqttConnected = false;
        return false;
    }
}

void mqttLoop() {
    mqttClient.loop();

    // Check connection - update display if status changed
    static bool wasConnected = false;
    bool currentlyConnected = mqttClient.connected();
    
    if (!currentlyConnected) {
        // Connection lost - update display if status changed
        if (wasConnected && isMqttConnected) {
            isMqttConnected = false;
            displayShowState(currentState);
        }
        
        if (millis() - lastReconnectAttempt > MQTT_RECONNECT_DELAY) {
            lastReconnectAttempt = millis();

            bool connected = mqttConnect();
            if (!connected) {
                reconnectAttempts++;
                Serial.print(F("[MQTT] Reconnect attempt "));
                Serial.print(reconnectAttempts);
                Serial.println(F(" failed"));

                if (reconnectAttempts >= MAX_RECONNECT_ATTEMPTS) {
                    Serial.println(F("[MQTT] Max attempts reached"));
                    reconnectAttempts = 0;
                }
            } else {
                // Successfully reconnected - update display
                displayShowState(currentState);
            }
        }
    } else {
        // Is connected
        wasConnected = true;
    }

    // Send heartbeat
    if (millis() - lastHeartbeat > HEARTBEAT_INTERVAL) {
        lastHeartbeat = millis();
        publishHeartbeat();
    }
}

void publishMessage(const String& topic, const String& payload, bool retained = false) {
    if (!isMqttConnected) {
        Serial.println(F("[MQTT] Cannot publish - not connected"));
        return;
    }
    
    if (mqttClient.publish(topic.c_str(), payload.c_str(), retained)) {
        Serial.print(F("[MQTT] Published to "));
        Serial.print(topic);
        Serial.print(F(": "));
        Serial.println(payload);
    } else {
        Serial.print(F("[MQTT] Publish failed to "));
        Serial.println(topic);
    }
}

void publishStatus() {
    StaticJsonDocument<512> doc;
    doc["status"] = isMqttConnected ? "online" : "offline";
    // Device is only "ready" if all systems are connected
    doc["ready"] = (isWifiConnected && isMqttConnected && isNfcConnected);
    doc["state"] = currentState;
    doc["connections"] = JsonObject();
    doc["connections"]["wifi"] = isWifiConnected;
    doc["connections"]["mqtt"] = isMqttConnected;
    doc["connections"]["nfc"] = isNfcConnected;
    doc["operationMode"] = hasPendingWriteCommand ? "writer" : (readMode ? "reader" : "standby");
    doc["wifi_rssi"] = WiFi.RSSI();
    doc["wifi_ssid"] = WiFi.SSID();
    doc["ip_address"] = WiFi.localIP().toString();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["timestamp"] = millis();
    doc["version"] = DEVICE_VERSION;
    doc["debugMode"] = debugMode;
    doc["readMode"] = readMode;
    doc["hasPendingCommand"] = hasPendingWriteCommand;

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/status", payload);
}

void publishHeartbeat() {
    StaticJsonDocument<512> doc;
    doc["type"] = "heartbeat";
    doc["deviceId"] = deviceId;
    doc["state"] = currentState;
    // Device is only "ready" if all systems are connected
    doc["ready"] = (isWifiConnected && isMqttConnected && isNfcConnected);
    doc["connections"] = JsonObject();
    doc["connections"]["wifi"] = isWifiConnected;
    doc["connections"]["mqtt"] = isMqttConnected;
    doc["connections"]["nfc"] = isNfcConnected;
    doc["operationMode"] = hasPendingWriteCommand ? "writer" : (readMode ? "reader" : "standby");
    doc["wifi_rssi"] = WiFi.RSSI();
    doc["free_heap"] = ESP.getFreeHeap();
    doc["uptime"] = millis();
    doc["timestamp"] = millis();
    doc["debugMode"] = debugMode;
    doc["readMode"] = readMode;
    doc["hasPendingCommand"] = hasPendingWriteCommand;

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/heartbeat", payload);
}

void publishTagDetected(const String& tagId) {
    StaticJsonDocument<256> doc;
    doc["type"] = "tag_detected";
    doc["deviceId"] = deviceId;
    doc["tagId"] = tagId;
    doc["timestamp"] = millis();
    
    String payload;
    serializeJson(doc, payload);
    
    publishMessage(mqttTopicBase + "/result", payload);
}

void publishWriteResult(bool success, const String& error = "") {
    StaticJsonDocument<256> doc;
    doc["type"] = success ? "write_success" : "write_error";
    doc["deviceId"] = deviceId;
    doc["success"] = success;
    if (!success) {
        doc["error"] = error;
    }
    if (success && error.length() > 0) {
        doc["url"] = error; // Reuse error parameter for URL on success
        doc["error"] = "";
    }
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/result", payload);
}

void publishDebugStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "debug_status";
    doc["deviceId"] = deviceId;
    doc["debugEnabled"] = debugMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

