hebertreis/taptosow/esp8266-arduino/src/main.cpp
    publishMessage(mqttTopicBase + "/debug", payload);
}

void publishReadModeStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "read_mode_status";
    doc["deviceId"] = deviceId;
    doc["readModeEnabled"] = readMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/debug", payload);
}

void publishTagData(const String& tagId, const String& ndefUrl) {
    StaticJsonDocument<1024> doc;
    doc["type"] = "tag_data";
    doc["deviceId"] = deviceId;
    doc["tagId"] = tagId;
    doc["timestamp"] = millis();
    
    // Add NDEF URL if available
    if (ndefUrl.length() > 0) {
        doc["ndefUrl"] = ndefUrl;
    }

    // Read all sector data
    String sectorData = readAllSectorData();
    if (sectorData.length() > 0) {
        doc["sectorData"] = sectorData;
    }

    // Add debug data if enabled
    if (debugMode) {
        MFRC522::MIFARE_Key key;
        for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;

        MFRC522::Uid uid;
        if (mfrc522.PICC_ReadCardSerial()) {
            uid = mfrc522.uid;

            String uidStr = "";
            for (byte i = 0; i < uid.size; i++) {
                if (uid.uidByte[i] < 0x10) uidStr += "0";
                uidStr += String(uid.uidByte[i], HEX);
                if (i < uid.size - 1) uidStr += ":";
            }
            doc["uid"] = uidStr;
            doc["uidLength"] = uid.size;
            doc["tagType"] = mfrc522.PICC_GetTypeName((MFRC522::PICC_Type)uid.sak);

            mfrc522.PICC_HaltA();
        }

        // Read NDEF message details
        NfcTag tag = nfc.read();
        if (tag.hasNdefMessage()) {
            NdefMessage message = tag.getNdefMessage();
            doc["ndefRecordCount"] = message.getRecordCount();

            JsonArray records = doc.createNestedArray("ndefRecords");
            for (int i = 0; i < message.getRecordCount(); i++) {
                NdefRecord record = message.getRecord(i);
                JsonObject recordObj = records.createNestedObject();

                String recordType = "";
                byte typeLen = record.getTypeLength();
                for (int j = 0; j < typeLen; j++) {
                    char c = record.getType()[j];
                    if (c >= 32 && c < 127) recordType += c;
                }
                recordObj["type"] = recordType;

                String payloadStr = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) payloadStr += c;
                }
                recordObj["payload"] = payloadStr;
            }
        }
    }

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/result", payload);
}

// ============================================================================
// NFC WRITER FUNCTIONS
// ============================================================================

String generateOneTapGoUrl(const String& tenantId, const String& sectorId) {
    // Generate URL based on tenant and sector
    // Format: https://onetapgo.site/a/{uniqueId}
    // The uniqueId should be generated and stored in Firestore
    
    // For now, use a combination of device ID and timestamp
    String uniqueId = deviceId + "_" + String(millis());
    return "https://onetapgo.site/a/" + uniqueId;
}

bool writeNfcTag(const String& tenantId, const String& sectorId, const String& url) {
    Serial.println(F("\n[NFC] Starting write process..."));
    displayShowState(STATE_WRITING);

    // Create NDEF message
    NdefMessage message = NdefMessage();

    // Add URI record (primary) - optimized
    message.addUriRecord(url.c_str());

    // Add text record (secondary info)
    String textRecord = "OneTapGo - Tenant: " + tenantId + " Sector: " + sectorId;
    message.addTextRecord(textRecord.c_str());

    if (debugMode) {
        Serial.println(F("[NFC] === NFC Write Debug ==="));
        Serial.print(F("[NFC] URL to write: "));
        Serial.println(url);
        Serial.print(F("[NFC] Text record: "));
        Serial.println(textRecord);

        // Debug NDEF message size
        int messageSize = message.getEncodedSize();
        Serial.print(F("[NFC] Encoded message size: "));
        Serial.println(messageSize);
    }

    // Write to tag (optimized - no retry delay)
    bool success = nfc.write(message);

    if (success) {
        Serial.println(F("[NFC] Write successful"));
        displayShowState(STATE_SUCCESS);
        publishWriteResult(true, url);

        // Store tag data in Firestore via HTTPS call (optional)
        // storeTagInFirestore(tenantId, sectorId, url);

        return true;
    } else {
        Serial.println(F("[NFC] Write failed"));
        displayShowState(STATE_ERROR, "Write failed");
        publishWriteResult(false, "NFC write error");
        return false;
    }
}

void processNfcTag() {
    Serial.println(F("\n[NFC] Tag detected!"));
    
    // Step 1: Request tag (REQIDL) - same as rfid.request(rfid.REQIDL)
    MFRC522::StatusCode status;
    MFRC522::Uid uid;
    byte bufferATQA[2];
    byte bufferSize = sizeof(bufferATQA);
    
    status = mfrc522.PICC_RequestA(bufferATQA, &bufferSize);
    if (status != MFRC522::STATUS_OK) {
        Serial.print(F("[NFC] RequestA failed: "));
        Serial.println(mfrc522.GetStatusCodeName(status));
        return;
    }
    
    uid.size = sizeof(uid.uidByte);
    
    
    // Build tag ID from UID
    String tagId = "";
    for (byte i = 0; i < uid.size; i++) {
        if (uid.uidByte[i] < 0x10) tagId += "0";
        tagId += String(uid.uidByte[i], HEX);
        if (i < uid.size - 1) tagId += ":";
    }
    tagId.toUpperCase();
    
    Serial.print(F("[NFC] Tag UID: "));
    Serial.println(tagId);
    
    // Step 3: Select tag - same as rfid.select_tag()
    status = mfrc522.PICC_Select(&uid);
    if (status != MFRC522::STATUS_OK) {
        Serial.print(F("[NFC] Select failed: "));
        Serial.println(mfrc522.GetStatusCodeName(status));
        mfrc522.PICC_HaltA();
        return;
    }
    
    // Tag selected successfully - update state and display
    currentState = STATE_TAG_DETECTED;
    displayShowState(STATE_TAG_DETECTED);
    
    // Publish tag detection
    publishTagDetected(tagId);
    
