hebertreis/taptosow/esp8266-arduino/src/main.cpp
    // Small delay after select (same as Python code)
    delay(5);

    // Check if we have pending write command (priority)
    if (hasPendingWriteCommand && pendingTenantId.length() > 0 && 
        pendingSectorId.length() > 0 && pendingUrl.length() > 0) {
        
        // Wait for user to position tag correctly (reduced delay)
        displayShowMessage("Processing", "Keep tag steady...", 300);

        // Attempt write
        bool success = writeNfcTag(pendingTenantId, pendingSectorId, pendingUrl);

        // Clear pending command and reset state
        pendingTenantId = "";
        pendingSectorId = "";
        pendingUrl = "";
        hasPendingWriteCommand = false;

        if (success) {
            currentState = STATE_SUCCESS;
        } else {
            currentState = STATE_ERROR;
        }

        // Wait for tag removal
        Serial.println(F("[NFC] Waiting for tag removal..."));
        displayShowMessage("Complete", "Remove tag now", 0);

        unsigned long waitStart = millis();
        while (nfc.tagPresent() && (millis() - waitStart < 10000)) {
            yield();
            delay(100);
        }

        // Return to read mode (default) or idle
        currentState = readMode ? STATE_READ_MODE : STATE_IDLE;
        displayShowState(currentState);
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
        return;
    }
    
    // Read mode (default) - always transmit tag data to MQTT
    if (readMode || currentState == STATE_READ_MODE) {
        Serial.println(F("[NFC] Read mode - sending tag data"));

        // Extract NDEF URL first (faster)
        String ndefUrl = extractNdefUrl();

        // Send all data including sectors and URL
        publishTagData(tagId, ndefUrl);

        // Wait for tag removal
        waitForTagRemoval();

        // Return to read mode or idle
        currentState = readMode ? STATE_READ_MODE : STATE_IDLE;
        displayShowState(currentState);
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
        return;
    }

    // No mode specified and no pending command - just read and return
    Serial.println(F("[NFC] No pending write command"));
    currentState = STATE_IDLE;
    displayShowState(currentState);

    mfrc522.PICC_HaltA();
    mfrc522.PCD_StopCrypto1();
}

String readTagData() {
    String tagId = "tag_" + String(millis());

    if (debugMode) {
        Serial.println(F("[NFC] === Tag Read Debug ==="));

        // Read UID
        MFRC522::MIFARE_Key key;
        for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;

        MFRC522::Uid uid;
        if (mfrc522.PICC_ReadCardSerial()) {
            uid = mfrc522.uid;

            Serial.print(F("[NFC] Tag UID: "));
            for (byte i = 0; i < uid.size; i++) {
                if (uid.uidByte[i] < 0x10) Serial.print(F("0"));
                Serial.print(uid.uidByte[i], HEX);
                Serial.print(F(" "));
            }
            Serial.println();

            Serial.print(F("[NFC] UID length: "));
            Serial.println(uid.size);

            Serial.print(F("[NFC] Tag type: "));
            Serial.println(mfrc522.PICC_GetTypeName((MFRC522::PICC_Type)uid.sak));

            mfrc522.PICC_HaltA();
        }

        // Try to read NDEF data
        Serial.println(F("[NFC] Attempting to read NDEF data..."));
        NfcTag tag = nfc.read();
        if (tag.hasNdefMessage()) {
            NdefMessage message = tag.getNdefMessage();
            Serial.print(F("[NFC] NDEF records: "));
            Serial.println(message.getRecordCount());

            for (int i = 0; i < message.getRecordCount(); i++) {
                NdefRecord record = message.getRecord(i);
                Serial.print(F("[NFC] Record "));
                Serial.print(i);
                Serial.print(F(" Type: "));

                // Print type as hex bytes
                byte typeLen = record.getTypeLength();
                for (byte j = 0; j < typeLen; j++) {
                    byte b = record.getType()[j];
                    if (b < 0x10) Serial.print(F("0"));
                    Serial.print(b, HEX);
                    Serial.print(F(" "));
                }
                Serial.println();

                String payload = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) payload += c;
                }
                Serial.print(F("[NFC] Payload: "));
                Serial.println(payload);
            }
        } else {
            Serial.println(F("[NFC] No NDEF data or read failed"));
        }

        Serial.println(F("[NFC] ========================"));
    }

    return tagId;
}

String extractNdefUrl() {
    String url = "";
    
    // Try to read NDEF message
    NfcTag tag = nfc.read();
    if (!tag.hasNdefMessage()) {
        Serial.println(F("[NFC] No NDEF message found"));
        return "";
    }
    
    NdefMessage message = tag.getNdefMessage();
    int recordCount = message.getRecordCount();
    
    for (int i = 0; i < recordCount; i++) {
        NdefRecord record = message.getRecord(i);
        
        // Check if it's a URI record (type "U" or 0x55)
        byte typeLen = record.getTypeLength();
        if (typeLen == 1 && record.getType()[0] == 0x55) {
            // URI record found
            uint16_t payloadLen = record.getPayloadLength();
            if (payloadLen > 1) {
                byte prefixCode = record.getPayload()[0];
                
                // Get prefix based on code
                String prefix = "";
                if (prefixCode == 0x00) prefix = "";
                else if (prefixCode == 0x01) prefix = "http://www.";
                else if (prefixCode == 0x02) prefix = "https://www.";
                else if (prefixCode == 0x03) prefix = "http://";
                else if (prefixCode == 0x04) prefix = "https://";
                else prefix = "";
                
