hebertreis/taptosow/esp8266-arduino/src/main.cpp
    Serial.println(F("\n[SYS] Initialization complete"));
    Serial.print(F("[SYS] Free heap after init: "));
    Serial.println(ESP.getFreeHeap());
    
    // Log initial mode
    Serial.print(F("[SYS] Initial mode: "));
    Serial.println(readMode ? F("Reader (auto-transmitting)") : F("Standby"));
    if (hasPendingWriteCommand) {
        Serial.println(F("[SYS] Pending write command: YES"));
    }
}

void systemLoop() {
    // Check WiFi connection
    wifiCheckConnection();

    // Handle MQTT
    mqttLoop();

    // Update display periodically to show current mode and connection status
    static unsigned long lastDisplayUpdate = 0;
    static DeviceState lastKnownState = STATE_IDLE;
    static bool lastKnownWifi = false;
    static bool lastKnownMqtt = false;
    static bool lastKnownNfc = false;
    static bool lastKnownReadMode = readMode;
    static bool lastKnownHasPendingCommand = hasPendingWriteCommand;
    
    // Update display every 1 second or when state changes
    bool stateChanged = (currentState != lastKnownState ||
        isWifiConnected != lastKnownWifi ||
        isMqttConnected != lastKnownMqtt ||
        isNfcConnected != lastKnownNfc ||
        readMode != lastKnownReadMode ||
        hasPendingWriteCommand != lastKnownHasPendingCommand);
    
    if (millis() - lastDisplayUpdate > 1000 || stateChanged) {
        lastDisplayUpdate = millis();
        lastKnownState = currentState;
        lastKnownWifi = isWifiConnected;
        lastKnownMqtt = isMqttConnected;
        lastKnownNfc = isNfcConnected;
        lastKnownReadMode = readMode;
        lastKnownHasPendingCommand = hasPendingWriteCommand;
        
        Serial.print(F("[DISPLAY] Updating - Mode: "));
        Serial.print(hasPendingWriteCommand ? F("Writer") : (readMode ? F("Reader") : F("Standby")));
        Serial.print(F(", WiFi: "));
        Serial.print(isWifiConnected ? F("OK") : F("NO"));
        Serial.print(F(", MQTT: "));
        Serial.print(isMqttConnected ? F("OK") : F("NO"));
        Serial.print(F(", NFC: "));
        Serial.println(isNfcConnected ? F("OK") : F("NO"));
        
        displayShowState(currentState);
    }

    // NFC polling - same pattern as esp8266-python-writer
    // Check for tag only when in appropriate state
    if (currentState == STATE_WAITING_TAG || currentState == STATE_IDLE || currentState == STATE_READ_MODE) {
        // Request tag (REQIDL) - continuous polling like Python code
        byte bufferATQA[2];
        byte bufferSize = sizeof(bufferATQA);
        byte status = mfrc522.PICC_RequestA(bufferATQA, &bufferSize);

        if (status == MFRC522::STATUS_OK) {
            // Tag detected - small delay before processing
            delay(10);
            processNfcTag();
        }
    }

    // Check button (optional manual trigger)
    static unsigned long lastButtonCheck = 0;
    if (millis() - lastButtonCheck > 100) {
        lastButtonCheck = millis();
        if (digitalRead(BUTTON_PIN) == LOW) {
            delay(50); // Debounce
            if (digitalRead(BUTTON_PIN) == LOW) {
                Serial.println(F("[BTN] Button pressed"));
                // Could trigger manual write or other action
            }
        }
    }

    // Watchdog feed
    yield();
}

// ============================================================================
// ARDUINO SETUP & LOOP
// ============================================================================

void setup() {
    systemInit();
    displayShowState(STATE_IDLE);
}

void loop() {
    systemLoop();
}
